app/controllers/pages_controller.rb

  def create
    @page = Page.new(page_params)

    if @page.save
---
INSERT INTO "pages" ("page_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["page_url", "https://www.airpair.com/ruby-on-rails/posts/building-a-restful-api-in-a-rails-application"], ["created_at", 2016-09-14 12:16:45 UTC], ["updated_at", 2016-09-14 12:16:45 UTC]]